{
  "backend/main.mo": "Defines an empty Motoko actor serving as the backend canister placeholder with no methods implemented.",
  "feature_evidence.json": "Feature evidence report documenting the removal of the HP Partner First Silver badge card from the Certifications component, with high confidence and a reference to the affected file.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short human-readable summaries describing each component's purpose and current state.",
  "frontend/index.css": "Global CSS entry point for the frontend; currently empty.",
  "frontend/index.html": "HTML shell for the React SPA, setting the page title to 'HIZMET IT Services' and mounting the app at the root div.",
  "frontend/src/App.tsx": "Root React component that composes the full single-page layout by rendering Header, Hero, Services, Products, Certifications, AMC, and Footer in order.",
  "frontend/src/components/AMC.tsx": "Renders the Annual Maintenance Contract section as a centered card listing three AMC benefits with checkmark icons.",
  "frontend/src/components/Certifications.tsx": "Displays the 'Certifications & Partnerships' section heading and a placeholder message stating no certifications are currently listed, after the HP badge card was removed.",
  "frontend/src/components/Footer.tsx": "Footer component showing company address, multiple contact numbers and email, business hours, and business credentials (UDYAM, GST, GeM Seller ID) in a four-column grid.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with the company logo, desktop nav links, and a collapsible mobile menu that smooth-scrolls to page sections.",
  "frontend/src/components/Hero.tsx": "Hero section with a full-width background image, headline, description, and two CTA buttons for calling and scrolling to the contact section.",
  "frontend/src/components/Products.tsx": "Products section rendering three hardware product cards (laptops, desktops, peripherals) each with an image, title, and description.",
  "frontend/src/components/Services.tsx": "Services section displaying five IT service offerings (hardware repairs, printing, networking, data recovery, software) in a responsive card grid without images.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor via React Query, using the current Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark mode CSS custom properties (oklch color tokens) for the design system.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with oklch-based color tokens, custom fonts, border radii, shadows, and accordion animations, plus typography and container-queries plugins.",
  "project_state.json": "Tracks project state metadata for the HIZMET IT Services certificate design project, recording a completed feature to remove the HP Partner Silver badge from the Certifications component."
}