{
  "backend/main.mo": "Defines an empty Motoko actor serving as the backend canister placeholder with no methods implemented.",
  "feature_evidence.json": "Feature evidence report confirming that the HP Partner First Silver certificate image was removed from the Certifications component while keeping all other section content intact.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, describing their roles in the HIZMET IT Services single-page application.",
  "frontend/index.css": "Global CSS entry point for the frontend; currently empty.",
  "frontend/index.html": "HTML shell for the React SPA, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root application component that composes the full page layout by rendering Header, Hero, Services, Products, Certifications, AMC, and Footer sections in order.",
  "frontend/src/components/AMC.tsx": "Annual Maintenance Contract section that displays AMC benefits (priority support, preventive maintenance, cost-effective replacements) in a card with checkmark icons.",
  "frontend/src/components/Certifications.tsx": "Certifications & Partnerships section displaying an HP Partner First Silver badge card with partner tier label and expiry date, without any certificate image.",
  "frontend/src/components/Footer.tsx": "Footer component displaying company address, multiple contact numbers and email, business hours, and business credentials (UDYAM, GST, GeM Seller ID) in a four-column grid.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with the company logo, desktop nav links, and a collapsible mobile menu that smooth-scrolls to page sections.",
  "frontend/src/components/Hero.tsx": "Hero section with a full-width background image, headline, description, and two CTA buttons for calling and scrolling to the contact section.",
  "frontend/src/components/Products.tsx": "Products section rendering three hardware product cards (laptops, desktops, peripherals) each with an image, title, and description.",
  "frontend/src/components/Services.tsx": "Services section displaying five IT service offerings (hardware repairs, printing, networking, data recovery, software) in a responsive card grid without images.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH color variables, custom fonts, shadows, border radii, and accordion animations, plus typography and container-query plugins.",
  "project_state.json": "Tracks project metadata and feature state, recording one completed feature to remove the HP Partner First Silver certificate image from the Certifications component."
}