{
  "backend/main.mo": "Defines an empty Motoko actor serving as the backend canister placeholder with no methods implemented.",
  "feature_evidence.json": "Records evidence for the feature that removes the Certifications & Partnerships section and its navigation link, listing affected files and components.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short human-readable summaries describing each component's purpose.",
  "frontend/index.css": "Global CSS entry point for the frontend; currently empty.",
  "frontend/index.html": "HTML shell for the React SPA, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that composes the full single-page layout with Header, Hero, Services, Products, AMC, and Footer; the Certifications section has been removed.",
  "frontend/src/components/AMC.tsx": "Renders the Annual Maintenance Contract section as a card listing three AMC benefits with checkmark icons.",
  "frontend/src/components/Certifications.tsx": "Empty file representing the removed Certifications & Partnerships component.",
  "frontend/src/components/Footer.tsx": "Footer displaying company address, multiple contact numbers/email, business hours, and business credentials (UDYAM, GST, GeM Seller ID).",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, smooth-scroll desktop nav links, and a collapsible mobile menu; does not include a Certifications link.",
  "frontend/src/components/Hero.tsx": "Hero section with a background image, headline, description, and call-to-action buttons for calling and scrolling to contact.",
  "frontend/src/components/Products.tsx": "Products section rendering three hardware category cards (laptops, desktops, peripherals) with images and descriptions.",
  "frontend/src/components/Services.tsx": "Services section displaying five IT service offerings (hardware repair, printing, networking, data recovery, software) in a responsive card grid.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor via React Query, switching between anonymous and authenticated actors based on Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state across the app.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines light/dark mode CSS custom properties (oklch color tokens, radius, sidebar, chart variables) used throughout the app.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with oklch-based color tokens, custom fonts, shadows, border radii, and accordion keyframe animations, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state at version 3, recording a completed feature to remove the Certifications & Partnerships section and a pending action request to remove certification and partner column details from the UI."
}