{
  "backend/main.mo": "Empty Motoko actor serving as the backend canister entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting five completed features that add business credentials (UDYAM, GST, GeM Seller ID, email) to the Footer component with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing the single-page IT services website structure with header, hero, services, products, AMC sections, and footer with business credentials.",
  "frontend/index.css": "Empty CSS file (global styles are defined elsewhere or not present in this file).",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, title 'HIZMET IT Services', and script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component that assembles the full page layout with Header, Hero, Services, Products, AMC, and Footer components in a flex column structure.",
  "frontend/src/components/AMC.tsx": "Annual Maintenance Contract section component displaying AMC benefits (priority support, preventive maintenance, cost-effective replacements) in a centered card with checkmark icons.",
  "frontend/src/components/Footer.tsx": "Footer component with four-column grid layout displaying company address, contact numbers, business hours, and business credentials (UDYAM, GST, GeM Seller ID, email) with icons and UTM-tracked attribution link (truncated in source).",
  "frontend/src/components/Header.tsx": "Sticky header component with logo, responsive navigation menu (desktop/mobile), and smooth scroll functionality to page sections.",
  "frontend/src/components/Hero.tsx": "Hero section with background image overlay, headline about professional IT services, description text, and two CTA buttons for calling and booking visits.",
  "frontend/src/components/Products.tsx": "Products section displaying three hardware categories (laptops, custom desktops, peripherals) in a responsive card grid with images and descriptions.",
  "frontend/src/components/Services.tsx": "Services section showcasing five IT service offerings (hardware repairs, printer solutions, networking, data recovery, software sales) in a card grid layout without images.",
  "frontend/src/hooks/useActor.ts": "React hook that manages backend actor creation with Internet Identity authentication, using React Query for caching and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with AuthClient integration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a comprehensive design system including light/dark themes, color tokens (primary, secondary, muted, etc.), and sidebar styling using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom colors mapped to CSS variables, custom fonts (Inter, Poppins), border radius tokens, shadows, and accordion animations.",
  "project_state.json": "Project state tracking for HIZMET IT Services website, documenting existing features including navigation, hero section, services (hardware repair, networking, data recovery), product sales, and AMC offerings for Delhi customers."
}